Revit 2027 API
CompoundStructure.GetLayerAssociatedToRegion Method
 Gets the layer associated to a particular region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetLayerAssociatedToRegion(
	int regionId
)
Public Function GetLayerAssociatedToRegion (
	regionId As Integer
) As Integer
public:
int GetLayerAssociatedToRegion(
	int regionId
)
member GetLayerAssociatedToRegion :
        regionId : int -> int
Parameters
regionId Int32
 The id of a region.
Return Value
Int32
 The index of a layer in this CompoundStructure.
Exceptions
Exception | Condition
ArgumentsInconsistentException |  For a non-vertically compound structure, implicitly each layer is associated to its corresponding simple region.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace